Documents/АктВыполненныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктВыполненныхРабот</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТоплива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокТопливаВБаке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходныйКассовыйОрдер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусАктаВыполненныхРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЛитраТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоРасчетнымДокументам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктВыполненныхРабот/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мСтруктураПараметровДляПолученияДоговора Экспорт;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаКУдержанию = ОстатокТопливаВБаке * ЦенаЛитраТоплива; 
    СуммаДокумента = Услуги.Итог("Сумма") - СуммаКУдержанию;

	Если СуммаДокумента < 0 Тогда
		
		#Если Клиент Тогда
		Предупреждение("Сумма документа с учётом остатка топлива меньше 0 !",15,"Внимание !");			
		#КонецЕсли
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеШапки(Отказ)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Организация,Контрагент, ДоговорКонтрагента,БанковскийСчетКонтрагента");
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект , СтруктураОбязательныхПолей , Отказ , "");
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроверитьЗаполнениеШапки(Отказ);

КонецПроцедуры

Функция ПечатьАкта()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АКТВЫПОЛНЕННЫХРАБОТ_АКТ";

	Макет = ПолучитьМакет("АктВыполненныхРабот");
	
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	АктВыполненныхРабот.Номер,
	|	АктВыполненныхРабот.Дата,
	|	АктВыполненныхРабот.ДоговорКонтрагента,
	|	АктВыполненныхРабот.Контрагент КАК Получатель,
	|	АктВыполненныхРабот.Организация КАК Поставщик,
	|	АктВыполненныхРабот.Организация,
	|	АктВыполненныхРабот.СуммаДокумента,
	|	АктВыполненныхРабот.БанковскийСчетКонтрагента,
	|	АктВыполненныхРабот.НаименованиеТоплива,
	|	АктВыполненныхРабот.ОстатокТопливаВБаке,
	|	АктВыполненныхРабот.ЦенаЛитраТоплива
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|ГДЕ
	|	АктВыполненныхРабот.Ссылка = &ТекущийДокумент";  
	
	ЗапросШапка.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
        	
	Шапка = ЗапросШапка.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ЗапросУслуг = Новый Запрос;
	ЗапросУслуг.Текст =
	"ВЫБРАТЬ
	|	АктВыполненныхРаботУслуги.Номенклатура КАК Товар,
	|	СУММА(АктВыполненныхРаботУслуги.Количество) КАК Количество,
	|	АктВыполненныхРаботУслуги.Тариф КАК Цена,
	|	СУММА(АктВыполненныхРаботУслуги.Сумма) КАК Сумма,
	|	""точка"" КАК ЕдиницаИзмерения
	|ИЗ
	|	Документ.АктВыполненныхРабот.Услуги КАК АктВыполненныхРаботУслуги
	|ГДЕ
	|	АктВыполненныхРаботУслуги.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	АктВыполненныхРаботУслуги.Номенклатура,
	|	АктВыполненныхРаботУслуги.Тариф";
	
	ЗапросУслуг.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	
	ТаблицаУслуги = ЗапросУслуг.Выполнить().Выгрузить();
	 
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Акт");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата), 
	                    "ПолноеНаименование,ИНН,ФактическийАдрес");
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), 
	                    "ПолноеНаименование,ИНН,ФактическийАдрес");
	ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
	ТабДокумент.Вывести(ОбластьМакета); 
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	
	ТабДокумент.Вывести(ОбластьМакета);
	НомерСтроки = 0;
	
	Для Каждого СтрокаТабличнойЧасти Из ТаблицаУслуги Цикл	
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтроки.Параметры.Заполнить(СтрокаТабличнойЧасти);
		ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;                 
		ОбластьСтроки.Параметры.Товар = ПолучитьСодержаниеУслуги();    		

		ТабДокумент.Вывести(ОбластьСтроки);
		
	КонецЦикла;
	
	Если ТаблицаУслуги <> Неопределено Тогда
		Сумма = ТаблицаУслуги.Итог("Сумма");
	Иначе
		Сумма = 0;
	КонецЕсли;
	
	СуммаКУдержанию = Шапка.ОстатокТопливаВБаке * Шапка.ЦенаЛитраТоплива; 
	ВсегоКОплате = Сумма - СуммаКУдержанию; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");	
	ОбластьМакета.Параметры.Всего = ОбщегоНазначения.ФорматСумм(Сумма); 
	ОбластьМакета.Параметры.ВсегоКОплате = ОбщегоНазначения.ФорматСумм(ВсегоКОплате);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
	ОбластьМакета.Параметры.ВсегоНДС = "-";
	ТабДокумент.Вывести(ОбластьМакета);
	
	СуммаКПрописи = ВсегоКоплате;  
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью"); 
	
	Если СуммаКУдержанию = 0 Тогда
		
		ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего оказано услуг " + НомерСтроки + ", на сумму " + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, мВалютаРегламентированногоУчета);
		ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, мВалютаРегламентированногоУчета);
		
	Иначе
		
		ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего оказано услуг " + НомерСтроки + ", на сумму " + ОбщегоНазначения.ФорматСумм(Сумма, мВалютаРегламентированногоУчета) + Символы.ПС +
		"С учетом остатка топлива " + СокрЛП(Шапка.НаименованиеТоплива) + " в баке " + Формат(Шапка.ОстатокТопливаВБаке,"ЧЦ=15; ЧДЦ=3; ЧРД=,; ЧРГ=' '") + " литров х " + ОбщегоНазначения.ФорматСумм(Шапка.ЦенаЛитраТоплива, мВалютаРегламентированногоУчета) + " = " + ОбщегоНазначения.ФорматСумм(СуммаКУдержанию, мВалютаРегламентированногоУчета) +
		" к оплате " + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, мВалютаРегламентированногоУчета);
		ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, мВалютаРегламентированногоУчета); 
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
   
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Исполнитель = Шапка.Получатель.НаименованиеПолное;
	ОбластьМакета.Параметры.Заказчик    = Шапка.Организация;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьСчета()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АКТВЫПОЛНЕННЫХРАБОТ_СЧЕТ";
	
	Макет = ПолучитьМакет("Счет");

	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктВыполненныхРабот.Номер,
	|	АктВыполненныхРабот.Дата,
	|	АктВыполненныхРабот.ДоговорКонтрагента,
	|	АктВыполненныхРабот.Контрагент КАК Получатель,
	|	АктВыполненныхРабот.Организация,
	|	АктВыполненныхРабот.Организация КАК Поставщик,
	|	АктВыполненныхРабот.СуммаДокумента,
	|	АктВыполненныхРабот.БанковскийСчетКонтрагента КАК БанковскийСчет,
	|	АктВыполненныхРабот.НаименованиеТоплива,
	|	АктВыполненныхРабот.ОстатокТопливаВБаке,
	|	АктВыполненныхРабот.ЦенаЛитраТоплива
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|ГДЕ
	|	АктВыполненныхРабот.Ссылка = &ТекущийДокумент";
	
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ЗапросУслуг = Новый Запрос;
	ЗапросУслуг.Текст =
	"ВЫБРАТЬ
	|	АктВыполненныхРаботУслуги.Номенклатура КАК Товар,
	|	СУММА(АктВыполненныхРаботУслуги.Количество) КАК Количество,
	|	АктВыполненныхРаботУслуги.Тариф КАК Цена,
	|	СУММА(АктВыполненныхРаботУслуги.Сумма) КАК Сумма,
	|	""точка"" КАК ЕдиницаИзмерения
	|ИЗ
	|	Документ.АктВыполненныхРабот.Услуги КАК АктВыполненныхРаботУслуги
	|ГДЕ
	|	АктВыполненныхРаботУслуги.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	АктВыполненныхРаботУслуги.Номенклатура,
	|	АктВыполненныхРаботУслуги.Тариф";
	
	ЗапросУслуг.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	
	ТаблицаУслуги = ЗапросУслуг.Выполнить().Выгрузить();

	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата,, Шапка.БанковскийСчет);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ИНН = СведенияОПоставщике.ИНН;
	ОбластьМакета.Параметры.КПП = СведенияОПоставщике.КПП;
	
	Банк       = СведенияОПоставщике.Банк;
	БИК        = ?(ЗначениеЗаполнено(Банк),Банк.Код, "");
	КоррСчет   = ?(ЗначениеЗаполнено(Банк),Банк.КоррСчет, "");
	ГородБанка = ?(ЗначениеЗаполнено(Банк),Банк.Город, "");
	НомерСчета = СведенияОПоставщике.НомерСчета;
	
	ОбластьМакета.Параметры.БИКБанкаПолучателя               = БИК;
	ОбластьМакета.Параметры.БанкПолучателя                   = Банк;
	ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(Банк) + " " + ГородБанка;
	ОбластьМакета.Параметры.СчетБанкаПолучателя              = КоррСчет;
	ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = КоррСчет;
	ОбластьМакета.Параметры.СчетПолучателяПредставление      = НомерСчета;
	ОбластьМакета.Параметры.СчетПолучателя                   = НомерСчета;
	
	Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ПредставлениеПоставщикаДляПлатПоручения) Тогда
		ОбластьМакета.Параметры.ПредставлениеПоставщикаДляПлатПоручения = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
	КонецЕсли;   
	
	ТабДокумент.Вывести(ОбластьМакета); 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Счет на оплату");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ТекстПоставщик = "Поставщик " + Символы.ПС + "(Исполнитель)";
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата), 
	                      "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ТекстПокупатель = "Покупатель" + Символы.ПС + "(Заказчик)";
	ОбластьМакета.Параметры.ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), 
	                      "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	Всего = 0;			
	НомерСтроки = 0;

	Для Каждого ТекСтр Из ТаблицаУслуги Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьМакета							 = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.НомерСтроки      = НомерСтроки;
		ОбластьМакета.Параметры.Товар 			 = ПолучитьСодержаниеУслуги();    		
		ОбластьМакета.Параметры.Количество 		 = ТекСтр.Количество;
		ОбластьМакета.Параметры.ЕдиницаИзмерения = "точка";
		ОбластьМакета.Параметры.Цена 			 = ТекСтр.Цена;		
		ОбластьМакета.Параметры.Сумма            = ТекСтр.Сумма;
		
		ТабДокумент.Вывести(ОбластьМакета); 
		
		Всего = Всего + ТекСтр.Сумма;			
		
	КонецЦикла;
	
	СуммаКУдержанию = Шапка.ОстатокТопливаВБаке * Шапка.ЦенаЛитраТоплива; 
	ВсегоКОплате = Всего - СуммаКУдержанию; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("НДС");
	ОбластьМакета.Параметры.Всего = Всего;
	ОбластьМакета.Параметры.ВсегоКОплате = ВсегоКОплате;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью"); 
	
	СуммаКПрописи = ВсегоКоплате;  
	
	Если СуммаКУдержанию = 0 Тогда
		
		ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего наименований " + НомерСтроки
		+ ", на сумму " + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, мВалютаРегламентированногоУчета);
		ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, мВалютаРегламентированногоУчета); 
		
	Иначе
		
		ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего наименований " + НомерСтроки
		+ ", на сумму " + ОбщегоНазначения.ФорматСумм(Всего, мВалютаРегламентированногоУчета) + Символы.ПС +
		"С учетом остатка топлива " + СокрЛП(Шапка.НаименованиеТоплива) + " в баке " + Формат(Шапка.ОстатокТопливаВБаке,"ЧЦ=15; ЧДЦ=3; ЧРД=,; ЧРГ=' '") + " литров х " 
		+ ОбщегоНазначения.ФорматСумм(Шапка.ЦенаЛитраТоплива, мВалютаРегламентированногоУчета) + " = " 
		+ ОбщегоНазначения.ФорматСумм(СуммаКУдержанию, мВалютаРегламентированногоУчета) +
		" к оплате " + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, мВалютаРегламентированногоУчета);
		
		ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, мВалютаРегламентированногоУчета); 
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалЗаказа");
    ОбластьМакета.Параметры.Исполнитель = Шапка.Получатель.НаименованиеПолное;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат  ТабДокумент;

КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	#Если НаКлиенте Тогда
	Если ЭтоНовый() Тогда
		
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
		
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
		
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "Акт" Тогда
		ТабДокумент = ПечатьАкта();
	ИначеЕсли ИмяМакета = "Счет" тогда 
		ТабДокумент = ПечатьСчета();  
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
	#КонецЕсли

КонецПроцедуры
	
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	СтруктураПечатныхФорм = Новый Структура("Акт,Счет",
	                                        "Акт выполненных работ",
	                                        "Счет на оплату");

	Возврат СтруктураПечатныхФорм;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Функция ПолучитьСодержаниеУслуги()
	
	Возврат "Услуги по ПГАТ за " + Формат(ДатаНачала, "ДФ='MMMM yyyy'") + " (с " + Формат(ДатаНачала, "ДФ=dd.MM.yyyy") + " по " + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy") + ")";    		

КонецФункции

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

мСтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки();
СписокДопустимыхВидовВзаиморасчетов = Новый СписокЗначений();
СписокДопустимыхВидовВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
СписокДопустимыхВидовВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);
мСтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовВзаиморасчетов", СписокДопустимыхВидовВзаиморасчетов);
